"-----------------------------------------------------
"          >>> VIM configuration file <<<
" あまりド派手な設定は入れない。IDE化はNeoVimでやる。
"-----------------------------------------------------

"==========================================
"  表示関係
"==========================================
set number
set relativenumber
set ambiwidth=double
set cursorline
set showcmd
syntax enable

"==========================================
"  編集関係
"==========================================
set expandtab "タブを空白文字に
set tabstop=2
set shiftwidth=2

"==========================================
"  キーバインド
"==========================================
inoremap jj <Esc>
